{
  "events": [
    {
      "title": "Google I/O 2023: How to watch & what to expect",
      "image": "https://www.trustedreviews.com/wp-content/uploads/sites/54/2023/05/How-to-watch-Google-IO-2023-920x518.jpeg",
      "date": "2023-09-09",
      "description": "Google I/O is one of the most exciting events in the Android smartphone calendar, marking the date that Google fully reveals the next big Android update, and it’s set to kick off very shortly.\n\nHowever, Google I/O isn’t always a strictly software-only event with the occasional hardware release in the past, and rumours suggest that could be the case with Google I/O 2023. If correct, the company could be planning a slew of hardware announcements.\n\nThey range from the expected – like the rumoured Pixel 7a – to the unexpected – like the Pixel Fold – and everything in between. Excited? You should be.\n\nHere’s everything you need to know about Google I/O 2023, from timings to watching the show live along with the latest on the expected hardware and software announcements. \n\nWhen is Google I/O 2023?\nGoogle I/O 2023 is set to kick off today, 10 May 2023 at 6pm BST, which translates to 1pm EDT and 10am PDT for those in the States or 7pm CEST for those tuning in from Europe. \n\nHow to watch Google I/O 2023 live\nAs with previous years, this year’s Google I/O keynote conference is set to be broadcast online and easily accessible to anyone that wants to tune in and see what Google has been working on over the past 12 months. If rumours are anything to go by, it’s set to be a particularly exciting one! \n\nThe main place to watch Google unveil its latest announcements is via YouTube and, more specifically, the Google YouTube channel. We’ve embedded the player below for convenience, so simply bookmark this page and head back later today to see what Google has up its sleeve. ",
      "id": "bf22fca0-d379-4c46-aff8-e49ca0cbf5e8"
    },
    {
      "title": "Tour Of Legends - Galle",
      "image": "https://mytickets.lk/contents/events/poster/tour%20of%20legends%20new%20%201%20event.jpg",
      "date": "2023-10-12",
      "description": "Please note that online tickets are only available for redeem from one hour before the start of the event until one hour after the event has started. MyTicketsLK will not issue online tickets after this time and cannot be held responsible for any inconvenience caused. To ensure you have enough time to enjoy the event, please make sure to arrive at the venue on time.",
      "id": "edd3de14-d06c-4a85-8405-97e6ab9a27c0"
    },
    {
      "title": "Ma Nowana Mama - මා නොවන මම",
      "image": "https://mytickets.lk/contents/events/poster/manowana%20mama%20new%20event%20banner.jpg",
      "date": "2023-08-29",
      "description": "Please note that our online tickets cannot be changed once purchased. This includes changes to the category, show, seat, price, or any other aspects of the ticket. We highly recommend that you carefully review your selection before completing your online purchase to ensure that you have chosen the correct ticket.",
      "id": "3c482616-c547-4caa-a1e9-10b2e24a8ec0"
    },
    {
      "title": "Sasara Wasana Thuru",
      "image": "https://netsync.lk/wp-content/uploads/2023/07/Sasara-wasana-thuru.jpg",
      "date": "2023-08-30",
      "description": "Whats happening in Sri Lanka Let's uncover the best events taking place in Sri Lanka Music events Arts and entertainment events Food and beverage events Art",
      "id": "70a145f4-020b-4c4e-b628-053292fe5e88"
    }
  ]
}
